[
    {
        "keywords": [
            "Hello World",
            "hello world",
            "helloworld"
        ],
        "description": "The first thing you write when you learn any programming language."
    },
    {
        "keywords": [
            "Intial Commit",
            "First commit",
            "inital commit"
        ],
        "description": "Your first open source contibution commit message. Welcome to Open-Source!"
    },
    {
        "keywords": [
            "Python",
            "py",
            "python"
        ],
        "description": "A high level programming language that is simple to use. It is an interpreted language, thus slower than its peers. Suitable for beginners."
    },
    {
        "keywords": [
            "Java",
            "java"
        ],
        "description": "A high level, class-based and object-oriented programming language. It is a sophisticated and powerful software designing tool."
    },
    {
        "keywords": [
            "Data Science",
            "data science",
            "DS"
        ],
        "description": "A field of science that deals with the study and analysis of data using numerous approaches and algorithms."
    },
    {
        "keywords": [
            "Machine Learning",
            "machine learning",
            "M L",
            "ML",
            "Ml",
            "ml"
        ],
        "description": "A field of Computer sciences that deals with teaching computers to solve  complex logical problems that are difficult to implement using traditional means."
    },
    {
        "keywords": [
            "Neural Network",
            "neural network",
            "N N",
            "NN",
            "nn"
        ],
        "description": "A network of nodes that share and process information using various activation/threshhold algorithm, that simulates the functionality of biological neurons on a computer."
    },
    
    {
        "keywords": [
            "Pandas",
            "pandas"
        ],
        "description": "A python library mainly used to process data files and visualise it in various forms."
    },
        {
        "keywords": [
            "Standardization",
            "standardization"
        ],
        "description": "A data manipulation method that converts numeric data in a way that mean = 0 and standard deviation = 1."
    },
    {
        "keywords": [
            "Normalization",
            "normalization"
        ],
        "description": "A data manipulation method that fits the numeric data between a scale of 0 to 1."
    },
    
    {
        "keywords": [
            "Numpy",
            "numpy"
        ],
        "description": "A python library mainly used to simulate time and space efficient mathematical equations and data structures."
    },
    {
        "keywords": [
            "Matplotlib",
            "matplotlib"
        ],
        "description": "A python library that automates the plotting of datapoints onto various types of graphical representations."
    },
    {
        "keywords": [
            "sk-learn",
            "scikit-learn",
            "sklearn"
        ],
        "description": "Sk-learn is a library of simple and efficient tools primariy used for predictive data analysis."
    },
    {
        "keywords": [
            "Tensorflow",
            "tensorflow"
        ],
        "description": "A python library that contains a huge collection of methods involving tensor data type that can be used for AI, ML and Deep Learning algorithms."
    },
    {
        "keywords": [
            "Tensor",
            "tensor"
        ],
        "description": "A tensor is a type of data structure which helps store and process huge amount of poly-dimensional data, it is expecially used in Tensorflow."
    },
    {
        "keywords": [
            "Stack",
            "stack"
        ],
        "description": "A stack is a type of data structure with a first-in-last-out policy, just like a stack of anything IRL."
    },
    {
        "keywords": [
            "Queue",
            "queue"
        ],
        "description": "A queue is a type of data structure with a first-in-first-out policy, just like a queue of people IRL."
    },
    
    {
        "keywords": [
            "Tuple",
            "tuple"
        ],
        "description": "A Python tuple is like an array of a series of member components which can be of any datatype. It is different from a list, as it is immutable."
    },
    
    {
        "keywords": [
            "List",
            "list"
        ],
        "description": "A Python list is like an array of a series of member components which can be of any datatype. It is very flexible in terms of operations like: append, pop, sort etc."
    },
    
    {
        "keywords": [
            "Set",
            "set",
            "Python Set",
            "python set"
        ],
        "description": "A Python set is like an array of a series of UNIQUE member components which can be of any datatype. It is iterable, mutable and has no duplicate elements."
    },
    {
        "keywords": [
            "Dictionary",
            "dictionary",
            "Python Dictionary",
            "python dictionary"
        ],
        "description": "A Python dictionary is a special implementation of 'set', where data can be stored in a form of Key-Value pair. It is iterable, mutable and has no duplicate elements."
    },
    {
        "keywords": [
            "Data structure",
            "data structure"
        ],
        "description": "A data structure is nothing but an arrangement and accessing method of numerous data points."
    },
    {
        "keywords": [
            "back end",
            "backend",
            "back-end",
            "Back End"
        ],
        "description": "Part of an application that performs an essential task not apparent to the user."
    },
    {
        "keywords": [
            "fron end",
            "frontend",
            "front-end",
            "Front End"
        ],
        "description": "Part of an application of producing HTML, CSS and JavaScript where user can see and interact with them directly."
    },
    {
        "keywords": [
            "malware",
            "Malware"
        ],
        "description": "Refers to a software program that has been developed to do harm to other computers. Malware is short for Malicious software. Types of malware include viruses, worms and spyware."
    },
    {
        "keywords": [
            "Spam",
            "spam"
        ],
        "description": " Spam refers to the unauthorized content that is intended to hinder the person's personal space or to share irrelevant messages in a bulk."
    },
    {
        "keywords": [
            "risk",
            "Risk"
        ],
        "description": "Risk refers to the potential threat that has occurred or has a due chance of occurring in the near future."
    },
    {
        "keywords": [
            "Data Visualization",
            "Data visualization",
            "data visualization"
        ],
        "description": "Data Visualization refers to the process that is needed to present the data in a insightful manner in the form of a graph."
    },
    {
        "keywords": [
            "Data Prediction",
            "data prediction",
            "Data prediction"
        ],
        "description": "Prediction refers to the forecast that is to be made on the newly available data based on the training data."
    },
    {
        "keywords": [
            "Supervised Learning",
            "supervised learning",
            "predictive learning"
        ],
        "description": "Training of the model requires both x(features) and y(labels) for training purpose and give prediction."
    },
    {
        "keywords": [
            "Unsupervised Learning",
            "unsupervised learning",
            "descriptive learning"
        ],
        "description": "Only features(x) are provided and classification is based on the basis of similarity and dis-similarity."
    },
    {
        "keywords": [
            "Boxplot",
            "boxplot"
        ],
        "description": "It is a type of graph which is used to plot the outliers(Points that deviate from the remaining data points)."
    },
    {
        "keywords": [
            "Data",
            "data",
            "DATA"
        ],
        "description": "Data is just the collection of raw facts which can be moulded into information."
    },
    {
        "keywords": [
            "Reinforcement Learning",
            "reinforcement learning",
            "Reinforcement learning"
        ],
        "description": "It works on the principle of reward which can be availed at the end of each achieved task. E.g.:- Q-learning."
    },
    {
        "keywords": [
            "PPC",
            "ppc",
            "pay per click"
        ],
        "description": "PPC or Pay Per Click refers to an advertising model, where the advertiser pays money each time their ad is clicked by interesting viewer."
    },
    {
        "keywords": [
            "cache"
        ],
        "description": "Cache is the fastest and most accessible segment of memory in computer architecture."
    },
    
    {
        "keywords": [
            "Git",
            "git",
            "GIT"
        ],
        "description": "Git is a version control system. Basically, if someone changes a file (like opens a document and writes stuff in it, changes a line of code, or so on) it records the differences between the new version and the old version, and maintains a history. This allows people to preserve differing versions, go back in time to earlier ones, review changes as they have occurred over time, and so on."
    },
    {
        "keywords": [
            "Github",
            "github",
            "GitHub",
            "GITHUB"
        ],
        "description": "Github is basically a powerful collaboration and project management tool for computer programming. It's designed to let people share coding projects with others and help manage those projects while allowing others to also contribute to the source code. It's primarily useful when you have multiple people working on the same code-base and you want to keep track of and review everyone's individual contributions to the project."
    }
]
